---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentSavedEventArgs
source: html/7bcc6ea7-4e7e-588b-232d-ed94d70d2c5e.htm
---
# Autodesk.Revit.DB.Events.DocumentSavedEventArgs

The event arguments used by the DocumentSaved event.

## Syntax (C#)
```csharp
public class DocumentSavedEventArgs : RevitAPIPostDocEventArgs
```